#!/bin/bash
# 更新远端服务器代码
# 使用方法;后端接口可在webpack.config.lt.js里面修改
# ##################################
# sh deploy_lt.sh lt1/lt2/lt3/lt4/lt5;
# #######################
echo "############################"
echo "hello 我是王彪选 ^^--^^"
echo "############################"
if [ -n "$1" ] && [ $1 = '123' ];then
  PORT="8081"
  path="/home/feuser/www/lt1/dist"
elif [ -n "$1" ] && [ $1 = '456' ]; then
  PORT="8082"
  path="/home/feuser/www/$1/dist"
else
  echo "######################################################################"
  echo "只能输入123 或者 456哦，你是不是老了，忘了呀？"
  echo "######################################################################"
  exit
fi
IP='10.6.3.183'
echo "这个好玩吗，请等待....."
echo '如想退出，按下 <CTRL-C> 直接退出':

echo "###################################"
echo "部署代码的路径是$path  $PORT"
echo "###################################"

echo "请输入密码用于创建服务器路径："
ssh feuser@$IP "mkdir -p $path"
echo "请再次输入密码用于上传文件："
# rsync -rvltOD ./dist/* "feuser@$IP:$pat"

echo "代码已上传完成！"
echo "###################################"
echo "访问地址是http://$IP:$PORT"
echo "###################################"
